Revit 2027 API
PaperSourceSet.Erase Method
Removes a specified object from the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual int Erase(
	PaperSource item
)
Public Overridable Function Erase (
	item As PaperSource
) As Integer
public:
virtual int Erase(
	PaperSource^ item
)
abstract Erase :
        item : PaperSource -> int
override Erase :
        item : PaperSource -> int
Parameters
item PaperSource
The item to be erased.
Return Value
Int32
The number of items that were erased from the set.
See Also
Reference
PaperSourceSet Class
Autodesk.Revit.DB Namespace